docs/load-test-results/2026-06-23-k6-1000-users/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: .\load-test\k6\scripts\practice-reservation-flow.js
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 6m35s max duration (incl. graceful stop):
              * reservation_flow: 1 iterations for each of 1000 VUs (maxDuration: 6m5s, gracefulStop: 30s)


Init               [  49% ] 0490/1000 VUs initialized
reservation_flow   [   0% ]

Init               [  92% ] 0918/1000 VUs initialized
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

Run                [ 100% ] setup()
reservation_flow   [   0% ]

running (1m17.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 1000 VUs  0m00.3s/6m5s  0000/1000 iters, 1 per VU

running (1m18.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 1000 VUs  0m01.3s/6m5s  0000/1000 iters, 1 per VU

running (1m19.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 1000 VUs  0m02.3s/6m5s  0000/1000 iters, 1 per VU

running (1m20.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 1000 VUs  0m03.3s/6m5s  0000/1000 iters, 1 per VU

running (1m21.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 1000 VUs  0m04.3s/6m5s  0000/1000 iters, 1 per VU

running (1m22.9s), 1000/1000 VUs, 0 complete and 0 interrupted iterations
reservation_flow   [   0% ] 1000 VUs  0m05.3s/6m5s  0000/1000 iters, 1 per VU

running (1m23.9s), 0981/1000 VUs, 19 complete and 0 interrupted iterations
reservation_flow   [   2% ] 1000 VUs  0m06.3s/6m5s  0019/1000 iters, 1 per VU

running (1m24.9s), 0981/1000 VUs, 19 complete and 0 interrupted iterations
reservation_flow   [   2% ] 1000 VUs  0m07.3s/6m5s  0019/1000 iters, 1 per VU

running (1m25.9s), 0964/1000 VUs, 36 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m08.3s/6m5s  0036/1000 iters, 1 per VU

running (1m26.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m09.3s/6m5s  0044/1000 iters, 1 per VU

running (1m27.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m10.3s/6m5s  0044/1000 iters, 1 per VU

running (1m28.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m11.3s/6m5s  0044/1000 iters, 1 per VU

running (1m29.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m12.3s/6m5s  0044/1000 iters, 1 per VU

running (1m30.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m13.3s/6m5s  0044/1000 iters, 1 per VU

running (1m31.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m14.3s/6m5s  0044/1000 iters, 1 per VU

running (1m32.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m15.3s/6m5s  0044/1000 iters, 1 per VU

running (1m33.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m16.3s/6m5s  0044/1000 iters, 1 per VU

running (1m34.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m17.3s/6m5s  0044/1000 iters, 1 per VU

running (1m35.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m18.3s/6m5s  0044/1000 iters, 1 per VU

running (1m36.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m19.3s/6m5s  0044/1000 iters, 1 per VU

running (1m37.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m20.3s/6m5s  0044/1000 iters, 1 per VU

running (1m38.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m21.3s/6m5s  0044/1000 iters, 1 per VU

running (1m39.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m22.3s/6m5s  0044/1000 iters, 1 per VU

running (1m40.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m23.3s/6m5s  0044/1000 iters, 1 per VU

running (1m41.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m24.3s/6m5s  0044/1000 iters, 1 per VU

running (1m42.9s), 0956/1000 VUs, 44 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m25.3s/6m5s  0044/1000 iters, 1 per VU

running (1m43.9s), 0955/1000 VUs, 45 complete and 0 interrupted iterations
reservation_flow   [   4% ] 1000 VUs  0m26.3s/6m5s  0045/1000 iters, 1 per VU

running (1m44.9s), 0943/1000 VUs, 57 complete and 0 interrupted iterations
reservation_flow   [   6% ] 1000 VUs  0m27.3s/6m5s  0057/1000 iters, 1 per VU

running (1m45.9s), 0900/1000 VUs, 100 complete and 0 interrupted iterations
reservation_flow   [  10% ] 1000 VUs  0m28.3s/6m5s  0100/1000 iters, 1 per VU

running (1m46.9s), 0869/1000 VUs, 131 complete and 0 interrupted iterations
reservation_flow   [  13% ] 1000 VUs  0m29.3s/6m5s  0131/1000 iters, 1 per VU

running (1m47.9s), 0864/1000 VUs, 136 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m30.3s/6m5s  0136/1000 iters, 1 per VU

running (1m48.9s), 0864/1000 VUs, 136 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m31.3s/6m5s  0136/1000 iters, 1 per VU

running (1m49.9s), 0864/1000 VUs, 136 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m32.3s/6m5s  0136/1000 iters, 1 per VU

running (1m50.9s), 0864/1000 VUs, 136 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m33.3s/6m5s  0136/1000 iters, 1 per VU

running (1m51.9s), 0862/1000 VUs, 138 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m34.3s/6m5s  0138/1000 iters, 1 per VU

running (1m52.9s), 0862/1000 VUs, 138 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m35.3s/6m5s  0138/1000 iters, 1 per VU

running (1m53.9s), 0862/1000 VUs, 138 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m36.3s/6m5s  0138/1000 iters, 1 per VU

running (1m54.9s), 0862/1000 VUs, 138 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m37.3s/6m5s  0138/1000 iters, 1 per VU

running (1m55.9s), 0862/1000 VUs, 138 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m38.3s/6m5s  0138/1000 iters, 1 per VU

running (1m56.9s), 0860/1000 VUs, 140 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m39.3s/6m5s  0140/1000 iters, 1 per VU

running (1m57.9s), 0855/1000 VUs, 145 complete and 0 interrupted iterations
reservation_flow   [  14% ] 1000 VUs  0m40.3s/6m5s  0145/1000 iters, 1 per VU

running (1m58.9s), 0853/1000 VUs, 147 complete and 0 interrupted iterations
reservation_flow   [  15% ] 1000 VUs  0m41.3s/6m5s  0147/1000 iters, 1 per VU

running (1m59.9s), 0840/1000 VUs, 160 complete and 0 interrupted iterations
reservation_flow   [  16% ] 1000 VUs  0m42.3s/6m5s  0160/1000 iters, 1 per VU

running (2m00.9s), 0777/1000 VUs, 223 complete and 0 interrupted iterations
reservation_flow   [  22% ] 1000 VUs  0m43.3s/6m5s  0223/1000 iters, 1 per VU

running (2m01.9s), 0771/1000 VUs, 229 complete and 0 interrupted iterations
reservation_flow   [  23% ] 1000 VUs  0m44.3s/6m5s  0229/1000 iters, 1 per VU

running (2m02.9s), 0770/1000 VUs, 230 complete and 0 interrupted iterations
reservation_flow   [  23% ] 1000 VUs  0m45.3s/6m5s  0230/1000 iters, 1 per VU

running (2m03.9s), 0770/1000 VUs, 230 complete and 0 interrupted iterations
reservation_flow   [  23% ] 1000 VUs  0m46.3s/6m5s  0230/1000 iters, 1 per VU

running (2m04.9s), 0769/1000 VUs, 231 complete and 0 interrupted iterations
reservation_flow   [  23% ] 1000 VUs  0m47.3s/6m5s  0231/1000 iters, 1 per VU

running (2m05.9s), 0768/1000 VUs, 232 complete and 0 interrupted iterations
reservation_flow   [  23% ] 1000 VUs  0m48.3s/6m5s  0232/1000 iters, 1 per VU

running (2m06.9s), 0768/1000 VUs, 232 complete and 0 interrupted iterations
reservation_flow   [  23% ] 1000 VUs  0m49.3s/6m5s  0232/1000 iters, 1 per VU

running (2m07.9s), 0760/1000 VUs, 240 complete and 0 interrupted iterations
reservation_flow   [  24% ] 1000 VUs  0m50.3s/6m5s  0240/1000 iters, 1 per VU

running (2m08.9s), 0758/1000 VUs, 242 complete and 0 interrupted iterations
reservation_flow   [  24% ] 1000 VUs  0m51.3s/6m5s  0242/1000 iters, 1 per VU

running (2m09.9s), 0752/1000 VUs, 248 complete and 0 interrupted iterations
reservation_flow   [  25% ] 1000 VUs  0m52.3s/6m5s  0248/1000 iters, 1 per VU

running (2m10.9s), 0738/1000 VUs, 262 complete and 0 interrupted iterations
reservation_flow   [  26% ] 1000 VUs  0m53.3s/6m5s  0262/1000 iters, 1 per VU

running (2m11.9s), 0702/1000 VUs, 298 complete and 0 interrupted iterations
reservation_flow   [  30% ] 1000 VUs  0m54.3s/6m5s  0298/1000 iters, 1 per VU

running (2m12.9s), 0691/1000 VUs, 309 complete and 0 interrupted iterations
reservation_flow   [  31% ] 1000 VUs  0m55.3s/6m5s  0309/1000 iters, 1 per VU

running (2m13.9s), 0674/1000 VUs, 326 complete and 0 interrupted iterations
reservation_flow   [  33% ] 1000 VUs  0m56.3s/6m5s  0326/1000 iters, 1 per VU

running (2m14.9s), 0671/1000 VUs, 329 complete and 0 interrupted iterations
reservation_flow   [  33% ] 1000 VUs  0m57.3s/6m5s  0329/1000 iters, 1 per VU

running (2m15.9s), 0667/1000 VUs, 333 complete and 0 interrupted iterations
reservation_flow   [  33% ] 1000 VUs  0m58.3s/6m5s  0333/1000 iters, 1 per VU

running (2m16.9s), 0662/1000 VUs, 338 complete and 0 interrupted iterations
reservation_flow   [  34% ] 1000 VUs  0m59.3s/6m5s  0338/1000 iters, 1 per VU

running (2m17.9s), 0652/1000 VUs, 348 complete and 0 interrupted iterations
reservation_flow   [  35% ] 1000 VUs  1m00.3s/6m5s  0348/1000 iters, 1 per VU

running (2m18.9s), 0632/1000 VUs, 368 complete and 0 interrupted iterations
reservation_flow   [  37% ] 1000 VUs  1m01.3s/6m5s  0368/1000 iters, 1 per VU

running (2m19.9s), 0597/1000 VUs, 403 complete and 0 interrupted iterations
reservation_flow   [  40% ] 1000 VUs  1m02.3s/6m5s  0403/1000 iters, 1 per VU

running (2m20.9s), 0584/1000 VUs, 416 complete and 0 interrupted iterations
reservation_flow   [  42% ] 1000 VUs  1m03.3s/6m5s  0416/1000 iters, 1 per VU

running (2m21.9s), 0579/1000 VUs, 421 complete and 0 interrupted iterations
reservation_flow   [  42% ] 1000 VUs  1m04.3s/6m5s  0421/1000 iters, 1 per VU

running (2m22.9s), 0575/1000 VUs, 425 complete and 0 interrupted iterations
reservation_flow   [  42% ] 1000 VUs  1m05.3s/6m5s  0425/1000 iters, 1 per VU

running (2m23.9s), 0572/1000 VUs, 428 complete and 0 interrupted iterations
reservation_flow   [  43% ] 1000 VUs  1m06.3s/6m5s  0428/1000 iters, 1 per VU

running (2m24.9s), 0570/1000 VUs, 430 complete and 0 interrupted iterations
reservation_flow   [  43% ] 1000 VUs  1m07.3s/6m5s  0430/1000 iters, 1 per VU

running (2m25.9s), 0570/1000 VUs, 430 complete and 0 interrupted iterations
reservation_flow   [  43% ] 1000 VUs  1m08.3s/6m5s  0430/1000 iters, 1 per VU

running (2m26.9s), 0564/1000 VUs, 436 complete and 0 interrupted iterations
reservation_flow   [  44% ] 1000 VUs  1m09.3s/6m5s  0436/1000 iters, 1 per VU

running (2m27.9s), 0557/1000 VUs, 443 complete and 0 interrupted iterations
reservation_flow   [  44% ] 1000 VUs  1m10.3s/6m5s  0443/1000 iters, 1 per VU

running (2m28.9s), 0550/1000 VUs, 450 complete and 0 interrupted iterations
reservation_flow   [  45% ] 1000 VUs  1m11.3s/6m5s  0450/1000 iters, 1 per VU

running (2m29.9s), 0545/1000 VUs, 455 complete and 0 interrupted iterations
reservation_flow   [  46% ] 1000 VUs  1m12.3s/6m5s  0455/1000 iters, 1 per VU

running (2m30.9s), 0528/1000 VUs, 472 complete and 0 interrupted iterations
reservation_flow   [  47% ] 1000 VUs  1m13.3s/6m5s  0472/1000 iters, 1 per VU

running (2m31.9s), 0483/1000 VUs, 517 complete and 0 interrupted iterations
reservation_flow   [  52% ] 1000 VUs  1m14.3s/6m5s  0517/1000 iters, 1 per VU

running (2m32.9s), 0476/1000 VUs, 524 complete and 0 interrupted iterations
reservation_flow   [  52% ] 1000 VUs  1m15.3s/6m5s  0524/1000 iters, 1 per VU

running (2m33.9s), 0470/1000 VUs, 530 complete and 0 interrupted iterations
reservation_flow   [  53% ] 1000 VUs  1m16.3s/6m5s  0530/1000 iters, 1 per VU

running (2m34.9s), 0455/1000 VUs, 545 complete and 0 interrupted iterations
reservation_flow   [  55% ] 1000 VUs  1m17.3s/6m5s  0545/1000 iters, 1 per VU

running (2m35.9s), 0444/1000 VUs, 556 complete and 0 interrupted iterations
reservation_flow   [  56% ] 1000 VUs  1m18.3s/6m5s  0556/1000 iters, 1 per VU

running (2m36.9s), 0432/1000 VUs, 568 complete and 0 interrupted iterations
reservation_flow   [  57% ] 1000 VUs  1m19.3s/6m5s  0568/1000 iters, 1 per VU

running (2m37.9s), 0428/1000 VUs, 572 complete and 0 interrupted iterations
reservation_flow   [  57% ] 1000 VUs  1m20.3s/6m5s  0572/1000 iters, 1 per VU

running (2m38.9s), 0426/1000 VUs, 574 complete and 0 interrupted iterations
reservation_flow   [  57% ] 1000 VUs  1m21.3s/6m5s  0574/1000 iters, 1 per VU

running (2m39.9s), 0422/1000 VUs, 578 complete and 0 interrupted iterations
reservation_flow   [  58% ] 1000 VUs  1m22.3s/6m5s  0578/1000 iters, 1 per VU

running (2m40.9s), 0402/1000 VUs, 598 complete and 0 interrupted iterations
reservation_flow   [  60% ] 1000 VUs  1m23.3s/6m5s  0598/1000 iters, 1 per VU

running (2m41.9s), 0367/1000 VUs, 633 complete and 0 interrupted iterations
reservation_flow   [  63% ] 1000 VUs  1m24.3s/6m5s  0633/1000 iters, 1 per VU

running (2m42.9s), 0356/1000 VUs, 644 complete and 0 interrupted iterations
reservation_flow   [  64% ] 1000 VUs  1m25.3s/6m5s  0644/1000 iters, 1 per VU

running (2m43.9s), 0341/1000 VUs, 659 complete and 0 interrupted iterations
reservation_flow   [  66% ] 1000 VUs  1m26.3s/6m5s  0659/1000 iters, 1 per VU

running (2m44.9s), 0328/1000 VUs, 672 complete and 0 interrupted iterations
reservation_flow   [  67% ] 1000 VUs  1m27.3s/6m5s  0672/1000 iters, 1 per VU

running (2m45.9s), 0324/1000 VUs, 676 complete and 0 interrupted iterations
reservation_flow   [  68% ] 1000 VUs  1m28.3s/6m5s  0676/1000 iters, 1 per VU

running (2m46.9s), 0318/1000 VUs, 682 complete and 0 interrupted iterations
reservation_flow   [  68% ] 1000 VUs  1m29.3s/6m5s  0682/1000 iters, 1 per VU

running (2m47.9s), 0296/1000 VUs, 704 complete and 0 interrupted iterations
reservation_flow   [  70% ] 1000 VUs  1m30.3s/6m5s  0704/1000 iters, 1 per VU

running (2m48.9s), 0237/1000 VUs, 763 complete and 0 interrupted iterations
reservation_flow   [  76% ] 1000 VUs  1m31.3s/6m5s  0763/1000 iters, 1 per VU

running (2m49.9s), 0213/1000 VUs, 787 complete and 0 interrupted iterations
reservation_flow   [  79% ] 1000 VUs  1m32.3s/6m5s  0787/1000 iters, 1 per VU

running (2m50.9s), 0210/1000 VUs, 790 complete and 0 interrupted iterations
reservation_flow   [  79% ] 1000 VUs  1m33.3s/6m5s  0790/1000 iters, 1 per VU

running (2m51.9s), 0205/1000 VUs, 795 complete and 0 interrupted iterations
reservation_flow   [  80% ] 1000 VUs  1m34.3s/6m5s  0795/1000 iters, 1 per VU

running (2m52.9s), 0192/1000 VUs, 808 complete and 0 interrupted iterations
reservation_flow   [  81% ] 1000 VUs  1m35.3s/6m5s  0808/1000 iters, 1 per VU

running (2m53.9s), 0149/1000 VUs, 851 complete and 0 interrupted iterations
reservation_flow   [  85% ] 1000 VUs  1m36.3s/6m5s  0851/1000 iters, 1 per VU

running (2m54.9s), 0098/1000 VUs, 902 complete and 0 interrupted iterations
reservation_flow   [  90% ] 1000 VUs  1m37.3s/6m5s  0902/1000 iters, 1 per VU

running (2m55.9s), 0097/1000 VUs, 903 complete and 0 interrupted iterations
reservation_flow   [  90% ] 1000 VUs  1m38.3s/6m5s  0903/1000 iters, 1 per VU

running (2m56.9s), 0094/1000 VUs, 906 complete and 0 interrupted iterations
reservation_flow   [  91% ] 1000 VUs  1m39.3s/6m5s  0906/1000 iters, 1 per VU

running (2m57.9s), 0080/1000 VUs, 920 complete and 0 interrupted iterations
reservation_flow   [  92% ] 1000 VUs  1m40.3s/6m5s  0920/1000 iters, 1 per VU

running (2m58.9s), 0053/1000 VUs, 947 complete and 0 interrupted iterations
reservation_flow   [  95% ] 1000 VUs  1m41.3s/6m5s  0947/1000 iters, 1 per VU


  █ THRESHOLDS 

    http_req_duration{name:practice.payment.complete}
    ✗ 'p(95)<1500' p(95)=2.2s
    ✓ 'p(99)<3000' p(99)=2.38s

    http_req_duration{name:practice.queue.enter}
    ✗ 'p(95)<1000' p(95)=3.71s
    ✗ 'p(99)<2000' p(99)=4.36s

    http_req_duration{name:practice.queue.join}
    ✗ 'p(95)<1000' p(95)=3.09s
    ✗ 'p(99)<2000' p(99)=3.22s

    http_req_duration{name:practice.reservation.create}
    ✗ 'p(95)<1500' p(95)=2.27s
    ✓ 'p(99)<3000' p(99)=2.54s

    http_req_duration{name:practice.seats.hold}
    ✗ 'p(95)<1500' p(95)=2.25s
    ✓ 'p(99)<3000' p(99)=2.48s

    http_req_duration{name:practice.seats}
    ✗ 'p(95)<1500' p(95)=2.47s
    ✓ 'p(99)<3000' p(99)=2.78s

    http_req_failed
    ✓ 'rate<0.02' rate=0.16%


  █ TOTAL RESULTS 

    checks_total.......: 25031  139.74888/s
    checks_succeeded...: 99.82% 24987 out of 25031
    checks_failed......: 0.17%  44 out of 25031

    ✓ practice.queue.session.create status is 2xx
    ✗ practice.queue.join status is 2xx
      ↳  97% — ✓ 971 / ✗ 29
    ✗ practice.queue.me status is 2xx
      ↳  99% — ✓ 13765 / ✗ 9
    ✗ practice.queue.enter status is 2xx
      ↳  99% — ✓ 956 / ✗ 6
    ✓ practice.sections status is 2xx
    ✓ practice.seats status is 2xx
    ✓ practice.queue.heartbeat status is 2xx
    ✓ practice.reservation.create status is 2xx
    ✓ practice.payment.request status is 2xx
    ✓ practice.payment.complete status is 2xx
    ✓ practice.reservation.get status is 2xx

    CUSTOM
    practice_reservation_flow_duration_ms....: avg=66207.153766 min=20304    med=69602.5  p(90)=93097.5 p(95)=95894.75 p(99)=96062.5 max=96173
    reservation_confirmed....................: 956    5.337379/s
    seat_hold_retry_conflict.................: 11     0.061413/s

    HTTP
    http_req_duration........................: avg=1.37s        min=0s       med=1.27s    p(90)=2.3s    p(95)=2.72s    p(99)=3.93s   max=5.28s
      { expected_response:true }.............: avg=1.38s        min=6.98ms   med=1.27s    p(90)=2.3s    p(95)=2.72s    p(99)=3.93s   max=5.28s
      { name:practice.payment.complete }.....: avg=950.09ms     min=79.3ms   med=838.12ms p(90)=1.83s   p(95)=2.2s     p(99)=2.38s   max=2.49s
      { name:practice.queue.enter }..........: avg=1.27s        min=0s       med=938.14ms p(90)=2.74s   p(95)=3.71s    p(99)=4.36s   max=5.28s
      { name:practice.queue.join }...........: avg=1.88s        min=0s       med=2.05s    p(90)=2.99s   p(95)=3.09s    p(99)=3.22s   max=3.43s
      { name:practice.reservation.create }...: avg=1.18s        min=190.62ms med=1.04s    p(90)=2.1s    p(95)=2.27s    p(99)=2.54s   max=3.14s
      { name:practice.seats.hold }...........: avg=1.13s        min=67.84ms  med=950.91ms p(90)=2.06s   p(95)=2.25s    p(99)=2.48s   max=3.12s
      { name:practice.seats }................: avg=1.28s        min=212.81ms med=1.1s     p(90)=2.25s   p(95)=2.47s    p(99)=2.78s   max=3.29s
    http_req_failed..........................: 0.16%  44 out of 26998
    http_reqs................................: 26998  150.730705/s

    EXECUTION
    iteration_duration.......................: avg=1m8s         min=5.64s    med=1m13s    p(90)=1m36s   p(95)=1m41s    p(99)=1m41s   max=1m41s
    iterations...............................: 1000   5.583032/s
    vus......................................: 53     min=0           max=1000
    vus_max..................................: 1000   min=488         max=1000

    NETWORK
    data_received............................: 218 MB 1.2 MB/s
    data_sent................................: 5.5 MB 31 kB/s



running (2m59.1s), 0000/1000 VUs, 1000 complete and 0 interrupted iterations
reservation_flow ✓ [ 100% ] 1000 VUs  1m41.5s/6m5s  1000/1000 iters, 1 per VU